@ahackettboyle Thanks for raising this issue. I read your configuration carefully, don't know if the following example can match your environment? I run the configuration under 6.2.4, and I cannot reproduce the problem:

**Validation:**
```
# cat maintst.tf
provider "fortios" {
  hostname = "192.168.52.177"
  token = "twHgtmQn30gps41388dds8m3drc3rw" #
  insecure = "true"
}

variable "forti-map" {
  type = map(object({
    tunnel = string
    port = string
  }))

  default  = {
    "T1a" = {
      tunnel = "1.1.1.1"
      port   = "port1"
    },
    "T2a" = {
      tunnel = "1.1.1.2"
      port   = "port2"
    },
    "T3a" = {
      tunnel = "1.1.1.3"
      port   = "port2"
    },
    "T4a" = {
      tunnel = "1.1.1.4"
      port   = "port2"
    },
    "T5a" = {
      tunnel = "1.1.1.5"
      port   = "port2"
    },
    "T6a" = {
      tunnel = "1.1.1.6"
      port   = "port2"
    },
    "T7a" = {
      tunnel = "1.1.1.7"
      port   = "port2"
    },
  }
}

resource "fortios_vpn_ipsec_phase1interface" "trname2" {
  for_each = var.forti-map
  name        = "VPN-${each.key}"
  type        = "static"
  interface   = each.value.port
  peertype    = "any"
  proposal    = "aes128-sha256 aes256-sha256 aes128-sha1 aes256-sha1"
  wizard_type = "custom"
  comments    = "Terraformed VPN Tunnel"
  remote_gw   = each.value.tunnel
  psksecret   = "eweeeeeeeecee"
  authmethod  = "psk"
  mode_cfg    = "disable"
}

# terraform plan
...
# terraform apply
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_vpn_ipsec_phase1interface.trname2["T1a"] will be created
  + resource "fortios_vpn_ipsec_phase1interface" "trname2" {
      + authmethod            = "psk"
      + authmethod_remote     = (known after apply)
      + certificate           = (known after apply)
      + comments              = "Terraformed VPN Tunnel"
      + id                    = (known after apply)
      + interface             = "port1"
      + ipv4_split_exclude    = (known after apply)
      + ipv4_split_include    = (known after apply)
      + mode_cfg              = "disable"
      + name                  = "VPN-T1a"
      + peer                  = (known after apply)
      + peergrp               = (known after apply)
      + peerid                = (known after apply)
      + peertype              = "any"
      + proposal              = "aes128-sha256 aes256-sha256 aes128-sha1 aes256-sha1"
      + psksecret             = "eweeeeeeeecee"
      + remote_gw             = "1.1.1.1"
      + split_include_service = (known after apply)
      + type                  = "static"
      + wizard_type           = "custom"
    }

  # fortios_vpn_ipsec_phase1interface.trname2["T2a"] will be created
  + resource "fortios_vpn_ipsec_phase1interface" "trname2" {
      + authmethod            = "psk"
      + authmethod_remote     = (known after apply)
      + certificate           = (known after apply)
      + comments              = "Terraformed VPN Tunnel"
      + id                    = (known after apply)
      + interface             = "port2"
      + ipv4_split_exclude    = (known after apply)
      + ipv4_split_include    = (known after apply)
      + mode_cfg              = "disable"
      + name                  = "VPN-T2a"
      + peer                  = (known after apply)
      + peergrp               = (known after apply)
      + peerid                = (known after apply)
      + peertype              = "any"
      + proposal              = "aes128-sha256 aes256-sha256 aes128-sha1 aes256-sha1"
      + psksecret             = "eweeeeeeeecee"
      + remote_gw             = "1.1.1.2"
      + split_include_service = (known after apply)
      + type                  = "static"
      + wizard_type           = "custom"
    }

  # fortios_vpn_ipsec_phase1interface.trname2["T3a"] will be created
  + resource "fortios_vpn_ipsec_phase1interface" "trname2" {
      + authmethod            = "psk"
      + authmethod_remote     = (known after apply)
      + certificate           = (known after apply)
      + comments              = "Terraformed VPN Tunnel"
      + id                    = (known after apply)
      + interface             = "port2"
      + ipv4_split_exclude    = (known after apply)
      + ipv4_split_include    = (known after apply)
      + mode_cfg              = "disable"
      + name                  = "VPN-T3a"
      + peer                  = (known after apply)
      + peergrp               = (known after apply)
      + peerid                = (known after apply)
      + peertype              = "any"
      + proposal              = "aes128-sha256 aes256-sha256 aes128-sha1 aes256-sha1"
      + psksecret             = "eweeeeeeeecee"
      + remote_gw             = "1.1.1.3"
      + split_include_service = (known after apply)
      + type                  = "static"
      + wizard_type           = "custom"
    }

  # fortios_vpn_ipsec_phase1interface.trname2["T4a"] will be created
  + resource "fortios_vpn_ipsec_phase1interface" "trname2" {
      + authmethod            = "psk"
      + authmethod_remote     = (known after apply)
      + certificate           = (known after apply)
      + comments              = "Terraformed VPN Tunnel"
      + id                    = (known after apply)
      + interface             = "port2"
      + ipv4_split_exclude    = (known after apply)
      + ipv4_split_include    = (known after apply)
      + mode_cfg              = "disable"
      + name                  = "VPN-T4a"
      + peer                  = (known after apply)
      + peergrp               = (known after apply)
      + peerid                = (known after apply)
      + peertype              = "any"
      + proposal              = "aes128-sha256 aes256-sha256 aes128-sha1 aes256-sha1"
      + psksecret             = "eweeeeeeeecee"
      + remote_gw             = "1.1.1.4"
      + split_include_service = (known after apply)
      + type                  = "static"
      + wizard_type           = "custom"
    }

  # fortios_vpn_ipsec_phase1interface.trname2["T5a"] will be created
  + resource "fortios_vpn_ipsec_phase1interface" "trname2" {
      + authmethod            = "psk"
      + authmethod_remote     = (known after apply)
      + certificate           = (known after apply)
      + comments              = "Terraformed VPN Tunnel"
      + id                    = (known after apply)
      + interface             = "port2"
      + ipv4_split_exclude    = (known after apply)
      + ipv4_split_include    = (known after apply)
      + mode_cfg              = "disable"
      + name                  = "VPN-T5a"
      + peer                  = (known after apply)
      + peergrp               = (known after apply)
      + peerid                = (known after apply)
      + peertype              = "any"
      + proposal              = "aes128-sha256 aes256-sha256 aes128-sha1 aes256-sha1"
      + psksecret             = "eweeeeeeeecee"
      + remote_gw             = "1.1.1.5"
      + split_include_service = (known after apply)
      + type                  = "static"
      + wizard_type           = "custom"
    }

  # fortios_vpn_ipsec_phase1interface.trname2["T6a"] will be created
  + resource "fortios_vpn_ipsec_phase1interface" "trname2" {
      + authmethod            = "psk"
      + authmethod_remote     = (known after apply)
      + certificate           = (known after apply)
      + comments              = "Terraformed VPN Tunnel"
      + id                    = (known after apply)
      + interface             = "port2"
      + ipv4_split_exclude    = (known after apply)
      + ipv4_split_include    = (known after apply)
      + mode_cfg              = "disable"
      + name                  = "VPN-T6a"
      + peer                  = (known after apply)
      + peergrp               = (known after apply)
      + peerid                = (known after apply)
      + peertype              = "any"
      + proposal              = "aes128-sha256 aes256-sha256 aes128-sha1 aes256-sha1"
      + psksecret             = "eweeeeeeeecee"
      + remote_gw             = "1.1.1.6"
      + split_include_service = (known after apply)
      + type                  = "static"
      + wizard_type           = "custom"
    }

  # fortios_vpn_ipsec_phase1interface.trname2["T7a"] will be created
  + resource "fortios_vpn_ipsec_phase1interface" "trname2" {
      + authmethod            = "psk"
      + authmethod_remote     = (known after apply)
      + certificate           = (known after apply)
      + comments              = "Terraformed VPN Tunnel"
      + id                    = (known after apply)
      + interface             = "port2"
      + ipv4_split_exclude    = (known after apply)
      + ipv4_split_include    = (known after apply)
      + mode_cfg              = "disable"
      + name                  = "VPN-T7a"
      + peer                  = (known after apply)
      + peergrp               = (known after apply)
      + peerid                = (known after apply)
      + peertype              = "any"
      + proposal              = "aes128-sha256 aes256-sha256 aes128-sha1 aes256-sha1"
      + psksecret             = "eweeeeeeeecee"
      + remote_gw             = "1.1.1.7"
      + split_include_service = (known after apply)
      + type                  = "static"
      + wizard_type           = "custom"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_vpn_ipsec_phase1interface.trname2["T4a"]: Creating...
fortios_vpn_ipsec_phase1interface.trname2["T6a"]: Creating...
fortios_vpn_ipsec_phase1interface.trname2["T2a"]: Creating...
fortios_vpn_ipsec_phase1interface.trname2["T3a"]: Creating...
fortios_vpn_ipsec_phase1interface.trname2["T1a"]: Creating...
fortios_vpn_ipsec_phase1interface.trname2["T7a"]: Creating...
fortios_vpn_ipsec_phase1interface.trname2["T5a"]: Creating...
fortios_vpn_ipsec_phase1interface.trname2["T5a"]: Creation complete after 0s [id=VPN-T5a]
fortios_vpn_ipsec_phase1interface.trname2["T7a"]: Creation complete after 0s [id=VPN-T7a]
fortios_vpn_ipsec_phase1interface.trname2["T4a"]: Creation complete after 0s [id=VPN-T4a]
fortios_vpn_ipsec_phase1interface.trname2["T2a"]: Creation complete after 0s [id=VPN-T2a]
fortios_vpn_ipsec_phase1interface.trname2["T3a"]: Creation complete after 0s [id=VPN-T3a]
fortios_vpn_ipsec_phase1interface.trname2["T6a"]: Creation complete after 0s [id=VPN-T6a]
fortios_vpn_ipsec_phase1interface.trname2["T1a"]: Creation complete after 0s [id=VPN-T1a]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.


# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_vpn_ipsec_phase1interface.trname2["T2a"]: Refreshing state... [id=VPN-T2a]
fortios_vpn_ipsec_phase1interface.trname2["T3a"]: Refreshing state... [id=VPN-T3a]
fortios_vpn_ipsec_phase1interface.trname2["T4a"]: Refreshing state... [id=VPN-T4a]
fortios_vpn_ipsec_phase1interface.trname2["T5a"]: Refreshing state... [id=VPN-T5a]
fortios_vpn_ipsec_phase1interface.trname2["T6a"]: Refreshing state... [id=VPN-T6a]
fortios_vpn_ipsec_phase1interface.trname2["T7a"]: Refreshing state... [id=VPN-T7a]
fortios_vpn_ipsec_phase1interface.trname2["T1a"]: Refreshing state... [id=VPN-T1a]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

Can you please provide us the following info?
1.  FortiGate firemware version(version field is enough)? (GUI: Dashboard->Status->System Information->Fireware or CLI: get system status->Version)
2.  Execute the terraform plan again after terraform apply, and then provide us with the output status of the vpnipsec_phase1interface part?

In addition:
1. According to your configuration, you are using the old version:https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs/resources/fortios_vpn_ipsec_phase1interface , we can see that there is a warning: The resource will be deprecated and replaced by fortios_vpnipsec_phase1interface. We recommend that you use new resources: fortios_vpnipsec_phase1interface:   https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs/resources/fortios_vpnipsec_phase1interface
2. Terraform has been upgraded to 0.13. If allowed, it is recommended that you upgrade terraform to version 0.13.

Let me know if you have any questions. Thanks!

